import { getStorageTemplate } from './utils/storage';

export const AppStorage = getStorageTemplate('app', {
    price: [4000, 5000],
    text: {
        rooms: {
            exclude: ['一房', '1房', '一居', '1居', '单间', '一室'],
            include: ['两房', '2房', '二居', '两居', '2居', '二房'],
        },
        rentType: {
            exclude: ['合租', '求租', '次卧', '室友', '主卧'],
            include: ['整租', '房东直租'],
        },
        position: {
            exclude: [
                '宝安', '西乡', '坪洲', '灵芝', '新安', '宝体', '固戍', '后瑞', '翻身',
                '龙岗', '坂田', '布吉', '百鸽笼', '大芬', '丹竹头', '木棉湾', '六约', '塘坑', '横岗', '永湖', '荷坳', '大运', '爱联', '龙城广场', '南联', '双龙',
                '龙华', '民乐', '白石龙', '深圳北', '清湖', '上塘', '红山', '长岭破',
                '罗湖', '大剧院',
            ],
            include: ['福田', '石厦', '景田', '莲花', '梅林', '上沙', '下沙', '五和'],
        },
    },
});